[
  {
    "path": "posts/2021-09-29-assignment-04/",
    "title": "🐉 Assignment 04",
    "description": "Using WLS to Model Data with Outliers",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-29",
    "categories": [
      "Assignments"
    ],
    "contents": "\nThe goal of this assignment is to give you experience using methods for estimating regression results under violation of homoskedasticity. You will again use the data from the file stack-1979.csv to evaluate the hypothesis from political science that suggests that countries that have a stronger Socialist party have less income inequality.\n[CSV]\n[Data Codebook]\n\nInstructions\nSubmit a printed document of your responses to the following questions. Please adhere to the following guidelines for further formatting your assignment:\nAll plots should be resized so that they do not take up more room than necessary.\nAll figures and tables should have a name (e.g., Figure 1) and an appropriate caption.\nIn questions that ask you to “use matrix algebra” to solve the problem, you can either show your syntax and output from carrying out the matrix operations, or you can use Equation Editor to input the matrices involved in your calculations.\nThis assignment is worth 20 points.\n\nExploratory Analysis\nStart by creating a scatterplot to examine the relationship between socialist party strength and income inequality (outcome).\nAre there observations that look problematic in this plot? If so, identify the country(ies).\nFit a linear model regressing income inequality on socialist party strength. Examine and report a set of regression diagnostics that allow you to identify any observations that are regression outliers.\n\nWeighted Least Squares Estimation\nRather than removing regression outliers from the data, we can instead fit a model that accounts for these observations. For example, fitting a model that allows for higher variance at \\(x\\)-values that have outliers. With higher variances, we would expect more extreme observations because of the increased variance. The WLS model allows for heteroskedasticity and can be used to model data that have extreme observations.\nCompute the empirical weights that you will use in the WLS estimation. Report the weight for the United States. (Hint: We do not know the true variances in the population.)\nFit the WLS model. Report the fitted equation.\nBased on the model results, what is suggested about the research hypothesis that countries with more socialist tendencies have less income inequality?\nCreate a scatterplot that shows the relationship between socialist party strength and income inequality. Include the country names as labels (or instead of the points). Include both the OLS and WLS regression lines on this plot.\nBased on the plot, comment on how the residuals from the WLS model compare to the residuals from the OLS model.\nBased on your response to Question #8, how will the model-level \\(R^2\\) value from the WLS model compare to the model-level \\(R^2\\) from the OLS model. Explain.\nThe mathematical formulaa for computing the studentized residuals for both the OLS and WLS models is given below. Compute and report the studentized residuals, using this formula, from both the OLS and WLS models for any regression outliers you identified in Question #2. (Hint: Remember that in an OLS regression the weight is 1 for each observation.)\n\\[\ne^{\\prime}_i = \\frac{e_i}{s_{e(-i)}\\sqrt{1-h_{ii}}} \\times \\sqrt{w_i}\n\\]\nBased on the values of the studentized residuals in the WLS model, are the observations you identified as regression outliers from the OLS model still regression outliers in the WLS model? Why or why not?\nExplain why the is the case by referring to the formula.\nCreate and report residual plots of the studentized residuals versus the fitted values for the OLS and WLS models. Comment on which model better fits the assumptions.\n\nIncluding Covariates\nNow include the energy covariate into the model to examine the effect of socilist strength after controlling for economic development. Since the model has changed, we need to re-compute the weights and re-carry out the WLS analysis.\nUse matrix algebra to compute the empirical weights based on the two-predictor model and report the weight for the United States.\nFit the two-predictor WLS model using matrix algebra. Report the fitted equation.\nCompute and report the standard errors of the two-predictor WLS model using matrix algebra.\nUsing your results from Questions #14 and #15, compute and report the t-values and p-values. While you can use the output of the tidy(), summary(), or other functions that automatically compute p-values to check your work, use the pt() function to answer this question. (Show your work or syntax for full credit.)\nBased on the two-predictor WLS model results, what is suggested about the research hypothesis that countries with more socialist tendencies have less income inequality?\nBased on the two-predictor OLS model results, what is suggested about the research hypothesis that countries with more socialist tendencies have less income inequality?\nWhich set of the model results should we trust. Explain by referring to the tenability of the assumptions.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-29T11:30:00-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-29-reading-variance-stabilizing-transformations/",
    "title": "📖 Variance Stabilizing Transformations",
    "description": "Reading",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-29",
    "categories": [
      "Reading"
    ],
    "contents": "\nRead the following article.\nOsborne, J. W. (2009). Notes on the use of data transformations. Practical Assessment, Research & Evaluation, 8(6).\n\nAdditional Resources\nKaufman, R. L. (2013). Heteroskedasticity in regression: Detection and correction. Sage. https://dx-doi-org.ezp1.lib.umn.edu/10.4135/9781452270128.n4\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-29T11:56:55-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-29-reading-wls-and-sandwich-estimation/",
    "title": "📖 Weighted Least Squares (WLS) and Sandwich Estimation",
    "description": "Reading",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-29",
    "categories": [
      "Reading"
    ],
    "contents": "\nRead the following chapter. It should be accessible via the link after logging in with your x500 and password.\nRead Kaufman, R. L. (2013). Heteroskedasticity-consistent (robust) standard errors. In Heteroskedasticity in regression: Detection and correction (pp. 43–50). Sage. https://dx-doi-org.ezp1.lib.umn.edu/10.4135/9781452270128.n4\n\nAdditional Resources\nShin, H.-C. (1998). Weighted least squares estimation with sampling weights. Journal of Econometrics, 8(2), 251–271.\nSolon, G., Haider, S. J., & Woolridge, J. (2013). What are we weighting for? (Working Paper No. 18859; NBER Working Paper Series). National Bureau of Economic Research.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-29T12:00:56-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-27-notes-tools-for-dealing-with-heteroskedasticity/",
    "title": "📝 Tools for Dealing with Heteroskedasticity",
    "description": "Notes",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-27",
    "categories": [
      "Notes"
    ],
    "contents": "\n\n\n\nIn this set of notes, we will use data from Statistics Canada’s Survey of Labour and Income Dynamics (SLID) to explain variation in the hourly wage rate of employed citizens in Ontario. The file slid.csv includes data collected in 1994 from employed citizens living in Ontario between the ages of 16 and 65.\n[CSV]\n[R Script File]\nThe variables in the dataset are:\nwages: Composite hourly wage rate based on all the participant’s jobs\nage: Age of the participant (in years)\neducation: Number of years of schooling\nmale: A dummy-coded predictor for sex (0=Non-male; 1=Male)\n\nData Exploration\nAs with any potential regression analysis, we will begin by importing the data and examining the scatterplot of each predictor with the outcome. These plots suggest that each of the predictors is related to the outcome.\n\n\n# Load libraries\nlibrary(broom)\nlibrary(car)\nlibrary(corrr)\nlibrary(ggExtra)\nlibrary(patchwork)\nlibrary(tidyverse)\n\n# Import data\nslid = read_csv(\"https://raw.githubusercontent.com/zief0002/epsy-8264/master/data/slid.csv\")\nhead(slid)\n\n\n# A tibble: 6 × 4\n  wages   age education  male\n  <dbl> <dbl>     <dbl> <dbl>\n1  10.6    40        15     1\n2  11      19        13     1\n3  17.8    46        14     1\n4  14      50        16     0\n5   8.2    31        15     1\n6  17.0    30        13     0\n\n\nNote that the read_csv() function can take a URL for a dataset stored on the web.\nHere we examine the marginal density plots for the outcome and each continuous predictor, along with the scatterplots showing the relationship between each predictor and the outcome.\n\n\n\nFigure 1: Scatterplot of hourly wage versus each predictor. The fitted regression line is also displayed in each plot.\n\n\n\nBased on what we see in these plots, the outcome (hourly wage) looks to be right-skewed. A skewed outcome may or may not be problematic. (It often leads to violations of the conditional normality or homoskedasticity assumption, although we cannot confirm until after we fit the model and examine the residuals.) The relationships between hourly wage and each of the three potential predictors seem linear. The plot with the age predictor, however, foreshadows that we might violate the homoskedasticity assumption (the variance of hourly wages seems to grow for higher ages), but we will withhold judgment until after we fit our multi-predictor model.\n\nFitting a Multi-Predictor Model\nNext, we fit a model regressing wages on the three predictors simultaneously and examine the residual plots. Because we will be looking at residual plots for many different fitted models, we will write and then use a function that creates these plots.\n\n\n# Function to create residual plots\nresidual_plots = function(object){\n  # Get residuals and fitted values\n  aug_lm = broom::augment(object)\n  \n  # Create residual plot\n  p1 = ggplot(data = aug_lm, aes(x =.resid)) +\n    educate::stat_density_confidence(model = \"normal\") +\n    geom_density() +\n    theme_light() +\n    xlab(\"Residuals\") +\n    ylab(\"Probability Density\")\n  \n  # Create residual plot\n  p2 = ggplot(data = aug_lm, aes(x =.fitted, y = .resid)) +\n    geom_hline(yintercept = 0, linetype = \"dashed\") +\n    geom_point() +\n    geom_smooth(method = \"loess\", se = TRUE, n = 50, span = 0.67) +\n    theme_light() +\n    xlab(\"FItted values\") +\n    ylab(\"Residuals\")\n  \n  \n  return(p1 | p2)\n}\n\n\n\n\nNote that the {educate} package is not available from CRAN, and only available via GitHub. To install this package use the install_github() function from the {remotes} package to install it. The full syntax is: remotes::install_github(\"zief0002/educate\").\nNow we can use our new function to examine the residual plots from the main-effects model.\n\n\n# Fit model\nlm.1 = lm(wages ~ 1 + age + education + male, data = slid)\n\n# Examine residual plots\nresidual_plots(lm.1)\n\n\n\n\nFigure 2: Residual plots for the model that includes the main effects of age, education level, and sex.\n\n\n\nExamining the residual plots:\nThe linearity assumption may be violated; the loess line suggests some nonlinearity (maybe due to omitted interaction/polynomial terms)\nThe normality assumption may be violated; the upper end of the distribution deviates from what would be expected from a normal distribution in the QQ-plot.\nThe homoskedasticity assumption is likely violated; the plot of studentized residuals versus the fitted values shows severe fanning; the variation in residuals seems to increase for higher fitted values.\nBecause of the nonlinearity, we might consider including interaction terms. The most obvious interaction is that between age and education level, as it seems like the effect of age on hourly wage might be moderated by education level. (Remember, do NOT include interactions unless they make theoretical sense!) Below we fit this model, still controlling for sex, and examine the residuals.\n\n\n\nFigure 3: Residual plots for the model that includes an interaction effect between age and education level.\n\n\n\nIncluding the age by education interaction term (age:education) seems to alleviate the nonlinearity issue, but the residual plots indicate there still may be violations of the normality and homoskedasticity assumptions. Violating normality is less problematic here since, given our sample size, the Central Limit Theorem will ensure that the inferences are still approximately valid. Violating homoskedasticity, on the other hand, is more problematic.\n\nViolating Homoskedasticity\nViolating the distributional assumption of homoskedasticity results in:\nIncorrect computation of the sampling variances and covariances; and because of this\nThe OLS estimates are no longer BLUE (Best Linear Unbiased Estimator).\nThis means that the SEs (and resulting t- and p-values) for the coefficients are incorrect. In addition, the OLS estimators are no longer the most efficient estimators. How bad this is depends on several factors (e.g., how much the variances differ, sample sizes).\n\nHeteroskedasticity: What is it and How do we Deal with It?\nRecall that the variance–covariance matrix for the residuals under the asssumption of homoskedasticity was:\n\\[\n\\boldsymbol{\\sigma^2}(\\boldsymbol{\\epsilon}) =  \\begin{bmatrix}\\sigma^2_{\\epsilon} & 0 & 0 & \\ldots & 0 \\\\ 0 & \\sigma^2_{\\epsilon} & 0 & \\ldots & 0\\\\ 0 & 0 & \\sigma^2_{\\epsilon} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & \\sigma^2_{\\epsilon}\\end{bmatrix}\n\\]\nHomoskedasticity implies that the variance for each residual was identical, namely \\(\\sigma^2_{\\epsilon}\\). Since the variance estimate for each residual was the same, we could estimate a single value for these variances, the residual variance, and use that to obtain the sampling variances and covariances for the coefficients:\n\\[\n\\boldsymbol{\\sigma^2_B} = \\sigma^2_{\\epsilon} (\\mathbf{X}^{\\prime}\\mathbf{X})^{-1}\n\\]\nHeteroskedasticy implies that the residual variances are not constant. We can represent the variance–covariance matrix of the residuals under heteroskedasticity as:\n\\[\n\\boldsymbol{\\sigma^2}(\\boldsymbol{\\epsilon}) =  \\begin{bmatrix}\\sigma^2_{1} & 0 & 0 & \\ldots & 0 \\\\ 0 & \\sigma^2_{2} & 0 & \\ldots & 0\\\\ 0 & 0 & \\sigma^2_{3} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & \\sigma^2_{n}\\end{bmatrix}\n\\]\nIn this matrix, each residual has a potentially different variance. Now, there is more than one residual variance, and estimating these variance becomes more complicated, as does estimating the sampling variances and covariances of the regression coefficients.\nThere are at least three primary methods for dealing with heteroskedasticity: (1) transform the y-values using a variance stablizing transformation; (2) fit the model using weighted least squares rather than OLS; or (3) adjust the SEs and covariances to account for the non-constant variances. We will examine each of these in turn.\nVariance Stabilizing Transformations\nThe idea behind using a variance stabilizing transformation on the outcome (y) is that the transformed y-values will be homoskedastic. If so, we can fit the OLS regression model using the transformed y-values; the inferences will be valid; and, if necessary, we can back-transform for better interpretations. There are several transformations that can be applied to y that might stabilize the variances. Two common transformations are:\nLog-transformation; \\(\\ln(Y)_i\\)\nSquare-root transformation; \\(\\sqrt{Y_i}\\)\n\nPrior to applying these transformations, you may need to add a constant value to each y-value so that all \\(y_i>0\\) (log-transformation) or all \\(y_i \\geq 0\\) (square-root transformation).\nBoth of these transformations are power transformations. Power transformations have the mathematical form:\n\\[\ny^*_i = y_i^{p}\n\\]\nwhere \\(y^*_i\\) is the transformed y-value, \\(y_i\\) is the original y-value, and p is an integer. The following are all power transformations of y:\n\\[\n\\begin{split}\n& ~\\vdots \\\\[0.5em]\n& Y^4 \\\\[0.5em]\n& Y^3 \\\\[0.5em]\n& Y^2 \\\\[1.5em]\n& Y^1 = Y \\\\[1.5em]\n& Y^{0.5} = \\sqrt{Y} \\\\[0.5em]\n& Y^0 \\equiv \\ln(Y) \\\\[0.5em]\n& Y^{-1} = \\frac{1}{Y} \\\\[0.5em]\n& Y^{-2} = \\frac{1}{Y^2} \\\\[0.5em]\n& ~\\vdots\n\\end{split}\n\\]\nPowers such that \\(p<1\\) are referred to as downward transformations, and those with \\(p>1\\) are referred to as upward transformations. Both the log-transformation and square-root transformation are downward transformations of y. Here we will fit the main effects model using the square-root trnsformation and the log-transformation of the hourly wage values.\n\n\n# Create transformed y-values\nslid = slid %>%\n  mutate(\n    sqrt_wages = sqrt(wages),\n    ln_wages = log(wages)\n  )\n\n# Fit models\nlm_sqrt = lm(sqrt_wages ~ 1 + age + education + male, data = slid)\nlm_ln = lm(ln_wages ~ 1 + age + education + male, data = slid)\n\n\n\nThe plots below show the residuals based on fitting a model with each of these transformations applied to the wages data.\n\n\n\nFigure 4: TOP: Residual plots for the main effects model that used a square root transformation on y. BOTTOM: Residual plots for the main effects model that used a logarithmic transformation on y.\n\n\n\nBoth of these residual plots seem to show less heterogeneity than the residuals from the model with untransformed wages. However, neither transformation seems to have “fixed” the problem completely.\n\nBox-Cox Transformation\nIs there a power transformation that would better “fix” the heteroskedasticity? In their seminal paper, Box & Cox (1964) proposed a series of power transformations that could be applied to data in order to better meet assumptions such as linearity, normality, and homoskedasticity. The general form of the Box-Cox model is:\n\\[\nY^{(\\lambda)}_i = \\beta_0 + \\beta_1(X1_{i}) + \\beta_2(X2_{i}) + \\ldots + \\beta_k(Xk_{i}) + \\epsilon_i\n\\]\nwhere the errors are independent and \\(\\mathcal{N}(0,\\sigma^2_{\\epsilon})\\), and\n\\[\nY^{(\\lambda)}_i = \\begin{cases}\n   \\frac{Y_i^{\\lambda}-1}{\\lambda} & \\text{for } \\lambda \\neq 0 \\\\[1em]\n   \\ln(Y_i)       & \\text{for } \\lambda = 0\n  \\end{cases}\n\\]\nThis is only defined for positive values of Y.\nThe powerTransform() function from the {car} library can be used to determine the optimal value of \\(\\lambda\\). The boxCox() function from the same library gives a profile plot showing the log-likelohoods for a sequence of \\(\\lambda\\) values. If you do not specify the sequence of \\(\\lambda\\) values it will use lambda = seq(from = -2, to = 2, by = 1/10) by default.\n\n\n# Find optimal power transformation using Box-Cox\npowerTransform(lm.1)\n\n\nEstimated transformation parameter \n        Y1 \n0.08598786 \n\nThe output from the powerTransform() function gives the optimal power for the transformation of y, namely \\(\\lambda = 0.086\\). To actually implement the power transformation we use the transform Y based on the Box-Cox algorithm presented earlier.\n\n\nslid = slid %>%\n  mutate(\n    bc_wages = (wages ^ 0.086 - 1) / 0.086\n  )\n\n# Fit models\nlm_bc = lm(bc_wages ~ 1 + age + education + male, data = slid)\n\n\n\nThe residual plots (shown below) indicate better behaved residuals for the main-effects model, although even this optimal transformation still shows some evidence of heteroskedasticity.\n\n\n\nFigure 5: Residual plots for the main effects model that used a Box-Cox transformation on Y with \\(\\lambda=0.086\\).\n\n\n\nOne problem with using this transformation is that the regression coefficients do not have a direct interpretation. For example, looking at the coefficent-level output:\n\n\ntidy(lm_bc, conf.int = TRUE)\n\n\n# A tibble: 4 × 7\n  term        estimate std.error statistic   p.value conf.low conf.high\n  <chr>          <dbl>     <dbl>     <dbl>     <dbl>    <dbl>     <dbl>\n1 (Intercept)   1.04    0.0475        21.9 1.80e-100   0.947     1.13  \n2 age           0.0227  0.000687      33.0 2.85e-211   0.0213    0.0240\n3 education     0.0707  0.00272       26.0 5.14e-138   0.0654    0.0760\n4 male          0.282   0.0164        17.2 4.99e- 64   0.250     0.315 \n\nThe age coefficient would be interpreted as: each one-year difference in age is associated with a 0.0227-unit difference in the transformed Y controlling for differences in education and sex. But what does a 0.227-unit difference in transformed Y mean when we translate that back to wages?\n\nProfile Plot for Different Transformations\nMost of the power transformations under Box-Cox would produce coefficients that are difficult to interpret. The exception is when \\(\\lambda=0\\). This is the log-transformation which is directly interpretable. Since the optimal \\(\\lambda\\) value of 0.086 is quite close to 0, we might wonder whether we could just use the log-transformation (\\(\\lambda=0\\)). The Box-Cox algorithm optimizes the log-likelihood of a given model, so the statistical question is whether there is a difference in the log-likelihood produced by the optimal transformation and that for the log-transformation.\nTo evaluate this, we can plot of the log-likelihood for a given model using a set of lambda values. This is called a profile plot of the log-likelihood. The boxCox() function creates a profile plot of the log-likelihood for a defined sequence of \\(\\lambda\\) values. Here we will plot the profile of the log-likelihood for \\(-2 \\leq \\lambda \\leq 2\\).\n\n\n# Plot of the log-likelihood for a given model versus a sequence of lambda values\nboxCox(lm.1, lambda = seq(from = -2, to = 2, by = 0.1))\n\n\n\n\nFigure 6: Plot of the log-likelihood profile for a given model versus a sequence of lambda values. The lambda that produces the highest log-likelihood is 0.086, the optimal lambda value.\n\n\n\nThe profile plot shows that the optimal lambda value, 0.86, produces the maximum log-likelihood value for the given model. We also are shown the 95% confidence limits for lambda based on a test of the curvature of the log-likelihood function. This interval offers a range of \\(\\lambda\\) values that will give comparable transformations. Since the values associated with the confidence limits are not outputted by the boxCox() function, we may need to zoom in to determine these limits by tweaking the sequence of \\(\\lambda\\) values in the boxCox() function.\n\n\nboxCox(lm.1, lambda = seq(from = 0.03, to = 0.2, by = .001))\n\n\n\n\nFigure 7: Plot of the log-likelihood profile for a given model versus a narrower sequence of lambda values.\n\n\n\nIt looks as though \\(.03 \\leq \\lambda \\leq 0.14\\) all give comparable transformations. Unfortunately, 0 is not included in those limits. This means that the \\(\\lambda\\) value of 0.086 will produce a higher log-likelihood than the log-transformation. It is important to remember that even though the log-likelihood will be optimized, the compatibility with the assumptions may or may not be improved when we use \\(\\lambda=0.086\\) versus \\(\\lambda=0\\). The only way to evaluate this is to fit the models and check the residuals.\n\nWeighted Least Squares Estimation\nAnother method for dealing with heteroskedasticity is to change the method we use for estimating the coefficients and standard errors. The most common method for doing this is to use weighted least squares (WLS) estimation rather than ordinary least squares (OLS).\nUnder heteroskedasticity recall that the residual variance of the ith residual is \\(\\sigma^2_i\\), and the variance–covariance matrix of the residuals is defined as,\n\\[\n\\boldsymbol{\\Sigma} =  \\begin{bmatrix}\\sigma^2_{1} & 0 & 0 & \\ldots & 0 \\\\ 0 & \\sigma^2_{2} & 0 & \\ldots & 0\\\\ 0 & 0 & \\sigma^2_{3} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & \\sigma^2_{n}\\end{bmatrix},\n\\]\nThis implies that the n observations no longer have the same reliability (i.e., precision of estimation). Observations with small variances have more reliability than observations with large variances. The idea behind WLS estimation is that those observations that are less reliable are down-weighted in the estimation of the overall error variance.\nAssume Error Variances are Known\nLet’s assume that each of the error variances, \\(\\sigma^2_i\\), are known. This is generally not a valid assumption, but it gives us a point to start from. If we know these values, we can modify the likelihood function from OLS by substituting these values in for the OLS error variance, \\(\\sigma^2_{\\epsilon}\\).\n\\[\n\\begin{split}\n\\mathrm{OLS:} \\qquad \\mathcal{L}(\\boldsymbol{\\beta}) &= \\prod_{i=1}^n \\frac{1}{\\sqrt{2\\pi\\sigma^2_{\\epsilon}}}\\exp\\left[-\\frac{1}{2\\sigma^2_{\\epsilon}} \\big(Y_i-\\beta_0 - \\beta_1X_{1i} - \\beta_2X_{2i} - \\ldots - \\beta_kX_{ki}\\big)^2\\right] \\\\[1em]\n\\mathrm{WLS:} \\qquad \\mathcal{L}(\\boldsymbol{\\beta}) &= \\prod_{i=1}^n \\frac{1}{\\sqrt{2\\pi\\sigma^2_{i}}}\\exp\\left[-\\frac{1}{2\\sigma^2_{i}} \\big(Y_i-\\beta_0 - \\beta_1X_{1i} - \\beta_2X_{2i} - \\ldots - \\beta_kX_{ki}\\big)^2\\right]\n\\end{split}\n\\]\nNext, we define the reciprocal of the error variances as \\(w_i\\), or weight:\n\\[\nw_i = \\frac{1}{\\sigma^2_i}\n\\]\nThis can be used to simplify the likelihood function for WLS:\n\\[\n\\begin{split}\n\\mathcal{L}(\\boldsymbol{\\beta}) &= \\bigg[\\prod_{i=1}^n \\sqrt{\\frac{w_i}{2\\pi}}\\bigg]\\exp\\left[-\\frac{1}{2} \\sum_{i=1}^n w_i\\big(Y_i-\\beta_0 - \\beta_1X_{1i} - \\beta_2X_{2i} - \\ldots - \\beta_kX_{ki}\\big)^2\\right]\n\\end{split}\n\\]\nWe can then find the coefficient estimates by maximizing \\(\\mathcal{L}(\\boldsymbol{\\beta})\\) with respect to each of the coefficients; these derivatives will result in k normal equations. Solving this system of normal equations we find that:\n\\[\n\\mathbf{b}_{\\mathrm{WLS}} = (\\mathbf{X}^{\\intercal}\\mathbf{W}\\mathbf{X})^{-1}\\mathbf{X}^{\\intercal}\\mathbf{W}\\mathbf{y}\n\\]\nwhere W is a diagonal matrix of the weights,\n\\[\n\\mathbf{W} =  \\begin{bmatrix}w_{1} & 0 & 0 & \\ldots & 0 \\\\ 0 & w_{2} & 0 & \\ldots & 0\\\\ 0 & 0 & w_{3} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & w_{n}\\end{bmatrix}\n\\]\nThe variance–covariance matrix for the regression coefficients can then be computed using:\n\\[\n\\boldsymbol{\\sigma^2}(\\mathbf{B}) = \\sigma^2_{\\epsilon}(\\mathbf{X}^{\\intercal}\\mathbf{W}\\mathbf{X})^{-1}\n\\]\nwhere the estimate for \\(\\sigma^2_{\\epsilon}\\) is based on a weighted sum of squares:\n\\[\n\\hat\\sigma^2_{\\epsilon} = \\frac{\\sum_{i=1}^n w_i \\times \\epsilon_i^2}{n - k - 1}\n\\]\nWhich can be expressed in matrix algebra as a function of the weight matrix and residual vector as:\n\\[\n\\hat\\sigma^2_{\\epsilon} = \\frac{(\\mathbf{We})^{\\intercal}\\mathbf{e}}{n - k - 1}\n\\]\n\nAn Example of WLS Estimation\nTo illustrate WLS, consider the following data which includes average ACT scores for a classroom of students, ACT score for the teacher, and the standard deviation of the class ACT scores.\n\n\nClass Average ACT\n\n\nTeacher ACT\n\n\nClass SD\n\n\n17.3\n\n\n21\n\n\n5.99\n\n\n17.1\n\n\n20\n\n\n3.94\n\n\n16.4\n\n\n19\n\n\n1.90\n\n\n16.4\n\n\n18\n\n\n0.40\n\n\n16.1\n\n\n17\n\n\n5.65\n\n\n16.2\n\n\n16\n\n\n2.59\n\n\nSuppose we want to use the teacher’s ACT score to predict variation in the class average ACT score. Fitting this model using OLS, we can compute the coefficient estimates and the standard errors for each coefficient.\n\n\n# Enter y vector\ny = c(17.3, 17.1, 16.4, 16.4, 16.1, 16.2)\n\n# Create design matrix\nX = matrix(\n  data = c(rep(1, 6), 21, 20 , 19, 18, 17, 16),\n  ncol = 2\n)\n\n# Compute coefficients\nb = solve(t(X) %*% X) %*% t(X) %*% y\n\n# Compute SEs for coefficients\ne = y - X %*% b\nsigma2_e = t(e) %*% e / (6 - 1 - 1) \nV_b = as.numeric(sigma2_e) * solve(t(X) %*% X)\nsqrt(diag(V_b))\n\n\n[1] 0.98356794 0.05294073\n\nWe could also have used built-in R functions to obtain these values:\n\n\nlm.ols = lm(y ~ 1 + X[ , 2])\ntidy(lm.ols, conf.int = TRUE)\n\n\n# A tibble: 2 × 7\n  term        estimate std.error statistic  p.value conf.low conf.high\n  <chr>          <dbl>     <dbl>     <dbl>    <dbl>    <dbl>     <dbl>\n1 (Intercept)   12.1      0.984      12.3  0.000252   9.36      14.8  \n2 X[, 2]         0.243    0.0529      4.59 0.0101     0.0959     0.390\n\nThe problem, of course, is that the variation in the residuals is not constant as the reliability for the 10 class average ACT values is not the same for each class; the standard deviations are different. Because of this, we may want to fit a WLS regression model rather than an OLS model.\n\n\n# Set up weight matrix, W\nclass_sd = c(5.99, 3.94, 1.90, 0.40, 5.65, 2.59)\nw_i = 1 / (class_sd ^ 2)\nW = diag(w_i)\nW\n\n\n          [,1]       [,2]      [,3] [,4]       [,5]      [,6]\n[1,] 0.0278706 0.00000000 0.0000000 0.00 0.00000000 0.0000000\n[2,] 0.0000000 0.06441805 0.0000000 0.00 0.00000000 0.0000000\n[3,] 0.0000000 0.00000000 0.2770083 0.00 0.00000000 0.0000000\n[4,] 0.0000000 0.00000000 0.0000000 6.25 0.00000000 0.0000000\n[5,] 0.0000000 0.00000000 0.0000000 0.00 0.03132587 0.0000000\n[6,] 0.0000000 0.00000000 0.0000000 0.00 0.00000000 0.1490735\n\n# Compute coefficients\nb_wls = solve(t(X) %*% W %*% X) %*% t(X) %*% W %*% y\nb_wls\n\n\n           [,1]\n[1,] 13.4154764\n[2,]  0.1658431\n\n# Compute standard errors for coefficients\ne_wls = y - X %*% b_wls                                 # Compute errors from WLS\nmse_wls = (t(W %*% e_wls) %*% e_wls) / (6 - 1 - 1)      # Compute MSE estimate\nv_b_wls = as.numeric(mse_wls) * solve(t(X) %*% W %*% X) # Compute variance-covariance matrix for B\nsqrt(diag(v_b_wls))\n\n\n[1] 1.17680463 0.06527187\n\nThe results of fitting both the OLS and WLS models appear below. Comparing the two sets of results, there is a difference in the coefficient values and in the estimated SEs when using WLS estimation rather than OLS estimation. This would also impact any statistical inference as well.\n\n\n\n\n\nOLS\n\n\n\n\nWLS\n\n\n\nCoefficient\n\n\nB\n\n\nSE\n\n\nB\n\n\nSE\n\n\nIntercept\n\n\n12.0905\n\n\n0.9836\n\n\n13.4155\n\n\n1.1768\n\n\nEffect of Teacher ACT Score\n\n\n0.2429\n\n\n0.0529\n\n\n0.1658\n\n\n0.0653\n\n\n\nFitting the WLS estimation in the lm() Function\nThe lm() function can also be used to fit a model using WLS estimation. To do this we include the weights= argument in lm(). This takes a vector of weights representing the \\(w_i\\) values for each of the n observations.\n\n\n# Create weights vector\nw_i = 1 / (class_sd ^ 2)\n\n# Fit WLS model\nlm_wls = lm(y ~ 1 + X[ , 2], weights = w_i)\ntidy(lm_wls, conf.int = TRUE)\n\n\n# A tibble: 2 × 7\n  term        estimate std.error statistic  p.value conf.low conf.high\n  <chr>          <dbl>     <dbl>     <dbl>    <dbl>    <dbl>     <dbl>\n1 (Intercept)   13.4      1.18       11.4  0.000338  10.1       16.7  \n2 X[, 2]         0.166    0.0653      2.54 0.0639    -0.0154     0.347\n\nNot only can we use tidy() and glance() to obtain coefficient and model-level summaries, but we can also use augment(), anova(), or any other function that takes a fitted model as its input.\n\nWhat if Error Variances are Unknown?\nThe previous example assumed that the variance–covariance matrix of the residuals was known. In practice, this is almost never the case. When we do not know the error variances, we need to estimate them from the data.\nOne method for estimating the error variances for each observation, is:\nFit an OLS model to the data, and obtain the residuals.\nSquare these residuals and regress them (using OLS) on the same set of predictors.\nObtain the fitted values from Step 2.\nCreate the weights using \\(w_i = \\frac{1}{\\hat{y}_i}\\) where \\(\\hat{y}_i\\) are the fitted values from Step 3.\nFit the WLS using the weights from Step 4.\nThis is a two-stage process in which we (1) estimate the weights, and (2) use those weights in the WLS estimation. We will illustrate this methodology using the SLID data.\n\n\n# Step 1: Fit the OLS regression\nlm_step_1 = lm(wages ~ 1 + age + education + male + age:education, data = slid)\n\n# Step 2: Obtain the residuals and square them\nout_1 = augment(lm_step_1) %>%\n  mutate(\n    e_sq = .resid ^ 2\n  )\n\n# Step 2: Regresss e^2 on the predictors from Step 1\nlm_step_2 = lm(e_sq ~ 1 + age + education + male + age:education, data = out_1)\n\n# Step 3: Obtain the fitted values from Step 2\ny_hat = fitted(lm_step_2)\n\n\n# Step 4: Create the weights\nw_i = 1 / (y_hat ^ 2)\n\n# Step 5: Use the fitted values as weights in the WLS\nlm_step_5 = lm(wages ~ 1 + age + education + male + age:education, data = slid, weights = w_i)\n\n\n\nBefore examining any output from this model, let’s examine the residual plots. The residual plots suggest that the homoskedasticity assumption is much more reasonably satisfied after using WLS estimation; although it is still not perfect. The normality assumption looks untenable here.\n\nOne way to proceed would be to apply a variance stabilizing transformation to y (e.g., log-transform) and then fit a WLS model. To do this you would go through the steps of estimating the weights again based on the transformed y.\n\n\n\nFigure 8: Residual plots for the model that includes the main effects of age, education level, and sex fitted with WLS estimation.\n\n\n\nThe WLS coefficient estimates, standard errors, and coefficient-level inference are presented below.\n\n\n# Examine coefficient-level output\ntidy(lm_step_5, conf.int = TRUE)\n\n\n# A tibble: 5 × 7\n  term          estimate std.error statistic   p.value conf.low conf.high\n  <chr>            <dbl>     <dbl>     <dbl>     <dbl>    <dbl>     <dbl>\n1 (Intercept)     4.97    0.227        21.9  1.37e-100   4.52      5.41  \n2 age             0.0801  0.00591      13.5  6.95e- 41   0.0685    0.0917\n3 education      -0.201   0.0316       -6.36 2.30e- 10  -0.263    -0.139 \n4 male            2.24    0.166        13.5  1.56e- 40   1.92      2.57  \n5 age:education   0.0185  0.000921     20.1  1.77e- 85   0.0167    0.0203\n\n\nAdjusting the Standard Errors: Sandwich Estimation\nSince the primary effect of heteroskedasticity is that the sampling variances and covariances are incorrect, one method of dealing with this assumption violation is to use the OLS coefficients (which are still unbiased under heteroskedasticity), but make adjustments to the variance–covariance matrix of the coefficients. We can compute the adjusted variance–covariance matrix of the regression coefficients using:\n\\[\nV(\\mathbf{b}) = (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\\mathbf{X}^{\\intercal}\\boldsymbol{\\Sigma}\\mathbf{X} (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\n\\]\nwhere, \\(\\boldsymbol{\\Sigma}\\) is the variance-covariance matrix of the residuals.\n\nThis is often referred to as a sandwich estimator because the \\(\\mathbf{X}^{\\intercal}\\boldsymbol{\\Sigma}\\mathbf{X}\\) is “sandwiched” between two occurrences of \\((\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\\).\nNote that under the standard regression assumptions (including homoskedasticity), \\(\\boldsymbol{\\Sigma} = \\sigma^2_{\\epsilon}\\mathbf{I}\\), and this whole expression can be simplified to the matrix expression of the variance–covariance matrix for the coefficients under the OLS model.:\n\\[\n\\begin{split}\nV(\\mathbf{b}) &= (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\\mathbf{X}^{\\intercal}\\sigma^2_{\\epsilon}\\mathbf{IX} (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1} \\\\[2ex]\n&= \\sigma^2_{\\epsilon}(\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\\mathbf{X}^{\\intercal}\\mathbf{IX} (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1} \\\\[2ex]\n&= \\sigma^2_{\\epsilon}(\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\\mathbf{X}^{\\intercal}\\mathbf{X} (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1} \\\\[2ex]\n&= \\sigma^2_{\\epsilon} \\mathbf{I} (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1} \\\\[2ex]\n&= \\sigma^2_{\\epsilon} (\\mathbf{X}^{\\intercal}\\mathbf{X})^{-1}\n\\end{split}\n\\]\nIf the errors are, however, heteroskedastic, then we need to use the heteroskedastic variance–covariance of the residuals,\n\\[\n\\boldsymbol{\\Sigma} =  \\begin{bmatrix}\\sigma^2_{1} & 0 & 0 & \\ldots & 0 \\\\ 0 & \\sigma^2_{2} & 0 & \\ldots & 0\\\\ 0 & 0 & \\sigma^2_{3} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & \\sigma^2_{n}\\end{bmatrix},\n\\]\nOne of the computational formulas for variance of a random variable X, using the rules of expectation is:\n\\[\n\\sigma^2_X = \\mathbb{E}\\bigg(\\big[X_i - \\mathbb{E}(X)\\big]^2\\bigg)\n\\]\nThis means for the ith error variance, \\(\\sigma^2_i\\), can be computed as\n\\[\n\\sigma^2_{i} = \\mathbb{E}\\bigg(\\big[\\epsilon_i - \\mathbb{E}(\\epsilon)\\big]^2\\bigg)\n\\]\nWhich, since \\(\\mathbb{E}(\\epsilon)=0\\) simplifies to\n\\[\n\\sigma^2_{i} = \\mathbb{E}\\big(\\epsilon_i^2\\big)\n\\]\nThis suggests that we can estimate \\(\\boldsymbol{\\Sigma}\\) as:\n\\[\n\\hat{\\boldsymbol{\\Sigma}} =  \\begin{bmatrix}\\epsilon^2_{1} & 0 & 0 & \\ldots & 0 \\\\ 0 & \\epsilon^2_{2} & 0 & \\ldots & 0\\\\ 0 & 0 & \\epsilon^2_{3} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & \\epsilon^2_{n}\\end{bmatrix},\n\\]\nIn other words, the estimated variance–covariance matrix of the residuals under heteroskedasticity is a diagonal matrix with elements that are the squared residuals from the OLS model. This\nGOing back to our SLID example, we can compute the adjusted variance–covariance matrix of the coefficients by using the sandwich estimation method.\n\n\n# Fit OLS model\nlm.ols = lm(wages ~ 1 + age + education + male, data = slid)\n\n# Design matrix\nX = model.matrix(lm.1)\n\n# Create Sigma matrix\ne_squared = augment(lm.1)$.resid ^ 2\nSigma = e_squared * diag(3997)\n\n# Variance-covariance matrix for B\nV_b_adj = solve(t(X) %*% X) %*% t(X) %*% Sigma %*% X %*% solve(t(X) %*% X)\n\n# Compute SEs\nsqrt(diag(V_b_adj))\n\n\n(Intercept)         age   education        male \n0.635836527 0.008807793 0.038468695 0.207141705 \n\nThe SEs we produce from this method are typically referred to as Huber-White standard errors because they were introduced in a paper by Huber (1967) and their some of their statistical properties were proved in a paper by White (1980).\n\nModifying the Huber-White Estimates\nSimulation studies by Long & Ervin (2000) suggest a slight modification to the Huber-White estimates; by using a slightly different \\(\\boldsymbol\\Sigma\\) matrix:\n\\[\n\\hat{\\boldsymbol{\\Sigma}} =  \\begin{bmatrix}\\frac{\\epsilon^2_{1}}{(1-h_{11})^2} & 0 & 0 & \\ldots & 0 \\\\ 0 & \\frac{\\epsilon^2_{2}}{(1-h_{22})^2} & 0 & \\ldots & 0\\\\ 0 & 0 & \\frac{\\epsilon^2_{3}}{(1-h_{33})^2} & \\ldots & 0\\\\ \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\ 0 & 0 & 0 & \\ldots & \\frac{\\epsilon^2_{n}}{(1-h_{nn})^2}\\end{bmatrix},\n\\] where, \\(h_{ii}\\) is the ith diagonal element from the H matrix.\nWe can compute this modification by adjusting the e_squared value in the R syntax as:\n\n\n# Sigma matrix\ne_squared = augment(lm.1)$.resid ^ 2  / ((1 - augment(lm.1)$.hat) ^ 2)\nSigma = e_squared * diag(3997)\n\n# Variance-covariance matrix for B\nV_b_hw_mod = solve(t(X) %*% X) %*% t(X) %*% Sigma %*% X %*% solve(t(X) %*% X)\n\n# Compute adjusted SEs\nsqrt(diag(V_b_hw_mod))\n\n\n(Intercept)         age   education        male \n0.637012622 0.008821005 0.038539628 0.207364732 \n\nWe could use these SEs to compute the t-values, associated p-values, and confidence intervals for each of the coefficients.\nThe three sets of SEs are:\n\n\n\n\n\nSE\n\n\n\nCoefficient\n\n\nOLS\n\n\nHuber-White\n\n\nModified Huber-White\n\n\nIntercept\n\n\n0.5989773\n\n\n0.6358365\n\n\n0.6370126\n\n\nAge\n\n\n0.0086640\n\n\n0.0088078\n\n\n0.0088210\n\n\nEducation\n\n\n0.0342567\n\n\n0.0384687\n\n\n0.0385396\n\n\nAge x Education\n\n\n0.2070092\n\n\n0.2071417\n\n\n0.2073647\n\n\nIn these data, the modified Huber-White adjusted SEs are quite similar to the SEs we obtained from OLS, despite the heteroskedasticity observed in the residuals. One advantage of this method is that we do not have to have a preconceived notion of the underlying pattern of variation like we do to use WLS estimation. (We can estimate the pattern using the multi-step approach introduced earlier, but this assumes that the method of estimation correctly mimics the pattern of variation.) If, however, we can identify the pattern of variation, then WLS estimation will produce more efficient (smaller) standard errors than sandwich estimation.\n\n\n\nBox, G. E. P., & Cox, D. R. (1964). An analysis of transformations. Journal of the Royal Statisistical Society, Series B, 26, 211–246.\n\n\nHuber, P. J. (1967). The behavior of maximum likelihood estimates under nonstandard conditiona. In L. M. Le Cam & J. Neyman (Eds.), Proceedings of the fifth berkeley symposium on mathematical statistics and probability (pp. 221–233). University of California Press.\n\n\nLong, J. S., & Ervin, L. H. (2000). Using heteroskedasticity consistent standard errors in the linear regression model. The American Statistician, 54, 217–224.\n\n\nWhite, H. (1980). A heteroskedasticity-consistent covariance matrix estimator and a direct test for heteroskedasticity. Econometrica, 38, 817–838.\n\n\n\n\n",
    "preview": "posts/2021-09-27-notes-tools-for-dealing-with-heteroskedasticity/distill-preview.png",
    "last_modified": "2021-09-29T12:15:07-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-23-notes-regression-diagnostics/",
    "title": "📝 Regression Diagnostics",
    "description": "Notes",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-26",
    "categories": [
      "Notes"
    ],
    "contents": "\nHere are links to several script files and handouts that we will use in class:\nSlides is a set of slides we will cover in class.\nScript File is a script file that provides syntax for generating data from a given population regression model.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-26T08:39:53-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-24-assignment-03/",
    "title": "🦄 Assignment 03",
    "description": "The goal of this assignment is to give you experience using regression diagnostics for detecting problematic observations.",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-24",
    "categories": [
      "Assignments"
    ],
    "contents": "\nThere is a hypothesis in political science that suggests that income inequality is related to the democratic experience and economic development of a country. In this assignment, you are going to examine whether this hypothesis is supported by empirical evidence by using the data provided in the file stack-1979.csv. In particular, you are going to regress income inequality on voter turnout (democratic experience) and energy consumption (economic development).\n[CSV]\n[Data Codebook]\nInstructions\nSubmit a printed document of your responses to the following questions. Please adhere to the following guidelines for further formatting your assignment:\nAll plots should be resized so that they do not take up more room than necessary.\nAll figures and tables should have a name (e.g., Figure 1) and an appropriate caption.\nIn questions that ask you to “use matrix algebra” to solve the problem, you can either show your syntax and output from carrying out the matrix operations, or you can use Equation Editor to input the matrices involved in your calculations.\nThis assignment is worth 18 points.\n\nExploratory Analysis\nStart by creating scatterplots to examine the relationship between each of the predictors and the outcome. Are there observations that look problematic in these plots? If so, identify the country(ies).\nFit the regression model (specified in the introduction) to the data. Report the fitted equation.\nCreate and include a set of plots that allow you to examine the assumptions for linear regression. Based on these plots, comment on the tenability of these assumptions.\n\nOutliers, Leverage, and Influence\nCompute the externally studentized residuals for the observations based on the fitted regression. Based on these values, identify any countries that you would consider as regression outliers. Explain why you identified these countries as regression outliers.\nFit a mean-shift model that will allow you to test whether the observation with the largest absolute studentized residual is statistically different from zero. Report the coefficient-level output (B, SE, t, and p) for this model.\nFind (and report) the Bonferroni adjusted p-value for the observation with the largest absolute studentized residual. Based on this p-value, is there statistical evidence to call this observation a regression outlier? Explain.\nCreate and include an index plot of the leverage values. Include a line in this plot that displays the cutpoint for “high” leverage. Based on this plot, identify any countries with large leverage values.\nBased on the evidence you have looked at in Questions #4–7, do you suspect that any of the countries might influence the regression coefficients? Explain.\n\nInfluence Measures\nFor each of the influence measures listed below, create and include an index plot of the influence measure. For each plot, also include a line that displays the cutpoint for “high” influence. (3pts)\nScaled (standardized) DFBETA values\nCook’s D\nDFFITS\nCOVRATIO\n\nShow how the Cook’s D value for the country with the largest Cook’s D value is calculated using the country’s leverage value and standardized residual.\nCreate and include the added-variable plots for each each of the coefficients. Based on these plots, identify any countries that you believe may be jointly influencing the regression coefficients.\n\nRemove and Refit\nBased on all of the evidence from the different influence measures you examined, identify and report the country(ies) that are influential. Explain how you decided on this set of observations.\nRemove the observations you identified in Question #12 from the data and refit the regression model omitting these observations. Report the fitted equation.\nCreate and include a set of plots that allow you to examine the assumptions for linear regression. Based on these plots, comment on the tenability of these assumptions.\nCompare and contrast the coefficient-level inferences from the model fitted with the full data and that fitted with the omitted observations.\nCompare and contrast the model-level summaries, namely \\(R^2\\) and the RMSE, from the model fitted with the full data and that fitted with the omitted observations.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-23T11:40:15-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-23-reading-regression-diagnostics/",
    "title": "📖 Regression Diagnostics",
    "description": "Reading",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-23",
    "categories": [
      "Reading"
    ],
    "contents": "\nRead the following chapter. It should be accessible via the link after logging in with your x500 and password.\nFox, J. (1991). Outlying and influential data. In Regression diagnostics (pp. 21–40). Sage. doi: https://dx-doi-org.ezp1.lib.umn.edu/10.4135/9781412985604.n4\n\nAdditional Resources\nKim, B. (2015). Understanding diagnostic plots for linear regression analysis. University of Virginia Library.\nCook, R. D. (1998). Regression graphics: Ideas for studying regressions through graphics. Wiley.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-29T11:55:12-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-16-assignment-02/",
    "title": "🦒 Assignment 02",
    "description": "Simulating from the Regression Model",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-20",
    "categories": [
      "Assignments"
    ],
    "contents": "\nThe goal of this assignment is to give you experience using simulation to explore properties of the regression model.\n\n\n\n\n\nInstructions\nSubmit a printed document of your responses to the following questions. Please adhere to the following guidelines for further formatting your assignment:\nAll plots should be resized so that they do not take up more room than necessary.\nAll figures and tables should have a name (e.g., Figure 1) and an appropriate caption.\nIn questions that ask you to “use matrix algebra” to solve the problem, you can either show your syntax and output from carrying out the matrix operations, or you can use Equation Editor to input the matrices involved in your calculations.\nThis assignment is worth 16 points.\n\nSimulation 1: Modeling Heteroskedasticity\nIn this simulation, you will explore what happens to the regression estimates when the assumption of homoskedasticity is violated. For this simulation use a sample size of 200.\nCreate the fixed X values you will use in each trial of the simulation. To do this, draw \\(n=200\\) X-values from a uniform distribution with a minimum of \\(-2\\) and a maximum of \\(+2\\). Prior to drawing these values, set your starting seed to 678910. Report the syntax you used, and the first six X values.\nCreate a the Y-values for the first trial of the simulation by using the model:\n\\[\n\\begin{split}\ny_i &= -3.2 + 1.75(x_i) + \\epsilon_i \\\\[2ex]\n\\epsilon_i &\\overset{i.i.d.}{\\sim} \\mathcal{N}(0, \\sigma)\n\\end{split}\n\\]\n\nwhere\n\n\\[\n\\begin{split}\n\\sigma &= e^{\\gamma(x_i)}\\\\[2ex]\ne &\\mathrm{~is~Euhler's~constant~}(\\approx2.718282) \\\\[2ex]\n\\gamma &= 1.5\n\\end{split}\n\\]\n\nHere the variation in the random error is a function of X and random noise. Report the syntax you used, and the first six Y values.\n\nCreate and report the scatterplot of the Y-values versus the X-values for this first trial of the simulation.\nDescribe the pattern of heteroscedasticity.\nDoes the pattern of heteroscedasticity you described in Question 4 make sense given how the error term was created. Explain.\nCarry out 1000 trials of the simulation. (Reminder: Be sure to use these same X values in each trial of the simulation; they are fixed.) For each trial, collect: (a) the estimate of the intercept, (b) the estimate of the slope, and (c) the estimate of the residual standard error.\nCompute and report the mean value for the residual standard error.\nSimulation 2: Homoskedastic Model\nTo evaluate the different estimates from the heteroskedasticity model, we need to compare them to estimates drawn from a homoskedastic model with the same population coefficients. To make the comparisons “fair”, so that we are only evaluating the effects of the heteroskedasticity, we also need to run this simulation using a residual standard error that is equal to the mean from the heteroskedastic simulation (i.e., \\(\\mathtt{sd\\neq1}\\) in the rnorm() function).\nCarry out 1000 trials of the simulation for the appropriate homoskedastic model. (Reminder: Be sure to use these same X values in this simulation as in the previous simulation.) For each trial, collect: (a) the estimate of the intercept, (b) the estimate of the slope, and (c) the estimate of the residual standard error. Report your syntax.\nComparing Results from the Two Simulations: Evaluating the Effects of Hetroskedasticity\nCreate a density plot of the distribution of intercept estimates. Show the density curve for both models on the same plot, differentiating the curves using color, linetype, or both. Also add a vertical line to this plot at the population value of the intercept.\nBased on your responses to Question 8, does the intercept estimate seem to be biased under heteroskedasticity? Explain.\nBased on your responses to Question 8, does the intercept estimate seem to be less efficient under heteroskedasticity? Explain.\nCreate a density plot of the distribution of slope estimates. Show the density curve for both models on the same plot, differentiating the curves using color, linetype, or both. Also add a vertical line to this plot at the population value of the slope\nBased on your responses to Question 11, does the slope estimate seem to be biased under heteroskedasticity? Explain.\nBased on your responses to Question 11, does the slope estimate seem to be less efficient under heteroskedasticity? Explain.\nCreate a density plot of the distribution of residual standard error estimates. Show the density curve for both models on the same plot, differentiating the curves using color, linetype, or both. Also add a vertical line to this plot at the population value of the residual standard error\nBased on your responses to Question 14, does the residual standard error estimate seem to be biased under heteroskedasticity? Explain.\nBased on your responses to Question 14, does the residual standard error estimate seem to be less efficient under heteroskedasticity? Explain.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-20T10:33:18-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-20-notes-simulating-from-the-regression-model/",
    "title": "📝 Simulating from the Regression Model",
    "description": "Notes",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-20",
    "categories": [
      "Notes"
    ],
    "contents": "\nHere are links to several script files and handouts that we will use in class:\nGenerating Data\nGenerating Random Data from a Regression Model is a script file that provides syntax for generating data from a given population regression model.\nSimulation 1: Simulating from a Regression Model\nSimulating from a Regression Model is a script file that provides syntax for carrying out a simulation to produce distributions of estimates from a regression model.\nVizualization of Simulating from a Regression Model is a handout visualizing the simulation process for generating data from a given population regression model.\nSimulation 2: Simulating from a Null Regression Model\nSimulating from a Null Regression Model is a script file that provides syntax for carrying out a simulation to produce distributions of estimates assuming certain parameters in the regression model are zero.\nVizualization of Simulating from a Null Regression Model is a handout visualizing the simulation process for generating data to produce distributions of estimates assuming certain parameters in the regression model are zero.\nResources\nHere are several resources to help your understanding of simulation. The chapters from Monte Carlo Simulation and Resampling Methods for Social Science should be accessible via the links after logging in with your x500 and password.\nProbability: Common probability distributions and how to compute with them.\nRandom Number Generation: Learn how to draw random numbers from different distributions. Also information about repeating processes in R, including writing your own functions, using for loops, and using if-else functions.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-20T13:18:51-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-18-reading-simulating-from-the-regression-model/",
    "title": "📖 Simulating from the Regression Model",
    "description": "Reading",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-18",
    "categories": [
      "Reading"
    ],
    "contents": "\nRead the following chapters from Carsey, T. M., & Harden, J. J. (2014). Monte Carlo simulation and resampling methods for social science. Sage. It should be accessible via the link after logging in with your x500 and password.\nIntroduction: This chapter gives a short introduction to the use of simulation in the social sciences.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-20T13:18:20-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-09-notes-ols-regression/",
    "title": "📝 OLS Regression Using Matrices and Its Properties",
    "description": "Notes",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-09-09",
    "categories": [
      "Notes"
    ],
    "contents": "\nHere are links to several PDF handouts:\nSummation, Expectation, Variance, Covariance, and Correlation is a handout that provides several mathematical rules for working with sums, expectations, variances, covariances, and correlation.\nOLS Estimators and Their Properties is a handout that steps through estimating the OLS regression estimators and also derives some of the properties of those estimators\nAssumptions for OLS Regression and the Gauss-Markov Theorem is a handout that examines the assumptions underlying the Gauss-Markov theorem; the theorem showing that the OLS estimators are BLUE.\nStatistical Inference for the Regression Model is a handout working through how we carry out coefficient-level and model-level statistical inference.\nA Regression Example in Practice is a handout that walks through using matrix algebra to compute many of the things we are interested in as applied researchers. It also show the equivalent built-in R functions for obtaining this.\nThe handouts include more detail than I will cover in class. I will highlight some important ideas from each of them, and you can work through some of the mathematical derivation on your own if it is of interest.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-10T09:14:00-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-14-reading-ols/",
    "title": "📖 OLS Regression using Matrices and its Properties",
    "description": "Reading",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-08-14",
    "categories": [
      "Reading"
    ],
    "contents": "\nRead the following (short) chapters in Matrix Algebra for Educational Scientists:\nSystems of Equations\nStatistical Application: Estimating Regression Coefficients\nIn class, we will be working through the ideas in the following chapters:\nImportant Matrices in Regression\nSums of Squares in Regression\nStandard Errors and Variance Estimates\nAssumptions of the Regression Model\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-20T13:12:23-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-11-worksheet-introduction-to-matrix-algebra/",
    "title": "📝 Introduction to Matrix Algebra",
    "description": "In-class worksheet",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-08-13",
    "categories": [
      "Worksheet"
    ],
    "contents": "\nDirections\nComplete the problems on this worksheet with your smallgroup. You may want to refer to the Matrix Algebra for Educational Scientists text.\nYou will likely be learning (or re-encountering) many new mathematical terms. It is a good idea to note and define all the vocabulary/terms that you encounter as you work through this worksheet. You may want to do this individually or create a shared document that you can all contribute to.\n\nProblems\nConsider the following matrices:\n\\[\n\\mathbf{A} = \\begin{bmatrix}3 & -2\\\\5 & 1\\end{bmatrix} \\quad \\mathbf{B} = \\begin{bmatrix}3 & -1\\\\-1 & 2\\end{bmatrix}\\quad \\mathbf{C} = \\begin{bmatrix}1 & 2 & 3\\\\0 & 1 & 2\\end{bmatrix}\n\\]\nMake sure everyone in your group can solve each of these problem by hand and using R.\nWhat are the dimensions of A? C?\nIs C a square matrix? Explain.\nFind the trace of A.\nFind the determinant of A.\nAdd A and B\nFind the transpose of C.\nBy referring to the dimensions, can you compute AC? How about CA?\nCompute AC.\nCompute BI\nCreate a \\(3\\times3\\) diagonal matrix whose trace is 10.\nHow do you know that B has an inverse? Explain.\nCompute \\(\\mathbf{B}^{-1}\\)\nCreate a \\(3\\times3\\) matrix that has rank 2. Verify this using R.\nCreate a \\(3\\times3\\) matrix that is symmetric and is not I.\nSolve the system of linear equations using algebra (e.g., substitution, elimination) and then solve them using matrix methods (with R). To do this you will need to read the Systems of Equations chapter in Matrix Algebra for Educational Scientists.\n\\[\n\\begin{split}\nx + y + z &= 2 \\\\\n6x - 4y + 5z &= 31 \\\\\n5x + 2y + 2z &= 13\n\\end{split}\n\\]\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-07T15:54:53-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-12-reading-introduction-to-matrix-algebra/",
    "title": "📖 Introduction to Matrix Algebra",
    "description": "Review some common mathematical ideas of matrix algebra.",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-08-12",
    "categories": [
      "Reading"
    ],
    "contents": "\nRead the following (short) chapters in Matrix Algebra for Educational Scientists:\nIntroduction\nData Structures\nVectors\nVector Operations\nIn class, we will be working through some problems to cement these ideas. We will also examine and work through some problems related to matrix operations, so you could also read through:\nMatrices\nMatrix Addition and Subtraction\nMatrix Multiplication\nMatrix Transposition\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-13T08:51:11-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-09-assignment-01/",
    "title": "🐧 Assignment 01",
    "description": "Matrix Algebra for Linear Regression",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-08-09",
    "categories": [
      "Assignments"
    ],
    "contents": "\nThe goal of this assignment is to give you experience using matrix algebra to compute various analytic output for regression. In this assignment, you will use the data given below that includes measurements for 10 countries on: infant mortality rate per 1000 live births (infant), the per-capita income (pci) and world region (region) of the country.\n\ncountry\ninfant\npci\nregion\nAlgeria\n86.3\n400\nAfrica\nBolivia\n60.4\n200\nAmericas\nBurundi\n150.0\n68\nAfrica\nDominican Republic\n48.8\n406\nAmericas\nKenya\n55.0\n169\nAfrica\nMalawi\n148.3\n130\nAfrica\nNicaragua\n46.0\n507\nAmericas\nParaguay\n38.6\n347\nAmericas\nRwanda\n132.9\n61\nAfrica\nTrinidad & Tobago\n26.2\n732\nAmericas\n\n\n\n\n\n\nInstructions\nSubmit a printed document of your responses to the following questions. Please adhere to the following guidelines for further formatting your assignment:\nAll plots should be resized so that they do not take up more room than necessary.\nAll figures and tables should have a name (e.g., Figure 1) and an appropriate caption.\nIn questions that ask you to “use matrix algebra” to solve the problem, you can either show your syntax and output from carrying out the matrix operations, or you can use Equation Editor to input the matrices involved in your calculations.\nThis assignment is worth 20 points.\n\nUnstandardized Regression\nYou will be fitting the model lm(infant ~ 1 + pci + region + pci:region). Within this model, use dummy coding to encode the region predictor and make Americas the reference group.\nWrite out the elements of the matrix \\(\\mathbf{X}^{\\intercal}\\mathbf{X}\\), where \\(\\mathbf{X}\\) is the design matrix.\nDoes \\(\\mathbf{X}^{\\intercal}\\mathbf{X}\\) have an inverse? Explain.\nCompute (using matrix algebra) and report the vector of coefficients, b for the OLS regression.\nCompute (using matrix algebra) and report the variance–covariance matrix of the coefficients.\nUse the values from b (Question 3) and from the variance–covariance matrix you reported in the previous question to find the 95% CI for the coefficient associated with the main-effect of PCI. (Hint: If you need to refresh yourself on how CIs are computed, see here.)\nCompute (using matrix algebra) and report the hat-matrix, H. Also show how you would use the values in the hat-matrix to find \\(\\hat{y}_1\\) (the predicted value for Algeria).\nCompute (using matrix algebra) and report the vector of residuals, e.\nCompute (using matrix algebra) and report the estimated value for the RMSE.\nGiven the assumptions of the OLS model and the RMSE estimate you computed in the previous question, compute and report the variance–covariance matrix of the residuals.\n\nANOVA Decomposition\nIn this section you will be re-creating the output from the ANOVA decomposition for the model fitted in the previous section.\nCompute (using matrix algebra) and report the model, residual, and total sum of squares terms in the ANOVA decomposition table. (2pts)\nCompute (using matrix algebra) and report the model, residual, and total degrees of freedom terms in the ANOVA decomposition table. (2pts)\nUse the values you obtained in Questions 11 and 12 to compute the model and residual mean square terms.\nUse the mean square terms you found in Question 13 to compute the F-value for the model (i.e., to test \\(H_0:\\rho^2=0\\)). Also compute the p-value associated with this F-value. (Hint: If you need to refresh yourself on how F-values or p-values are computed, see here.)\n\nRegression: Effects-Coding\nNow consider fitting the model to the data to examine whether there is an effect of region (no other predictors) on infant mortality. In this model, we will use effects-coding to encode the region variable (see here). This model is often expressed as:\n\\[\n\\mathrm{Infant~Mortality}_i = \\mu + \\alpha_{\\mathrm{Region}} + \\epsilon_i \n\\]\nWrite out the design matrix that would be used to fit this model.\nCompute (using matrix algebra) and report the vector of coefficients, b, from the OLS regression.\nCompute (using matrix algebra) and report the variance–covariance matrix for the coefficients.\nExplain why the sampling variances for the coefficients are the same and why the sampling covariance is zero by referring to computations produced in the matrix algebra. (2pts)\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-13T15:54:27-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-09-message-to-students/",
    "title": "A Message to Students",
    "description": "A message to students.",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-08-09",
    "categories": [],
    "contents": "\nIn this class, we will work together to develop a learning community that is inclusive and respectful, and where every student is supported in the learning process. As a class full of diverse individuals (reflected by differences in race, culture, age, religion, gender identity, sexual orientation, socioeconomic background, abilities, professional goals, and other social identities and life experiences) I expect that different students may need different things to support and promote their learning.\nThe TAs and I will do everything we can to help with this, but, as we only know what we know, we need you to communicate with us if things are not working for you or you need something we are not providing. I hope you all feel comfortable in helping to promote an inclusive classroom through respecting one another’s individual differences, speaking up, and challenging oppressive/problematic ideas. Finally, I look forward to learning from each of you and the experiences you bring to the class.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-09T16:10:51-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-09-prerequisites-and-resources/",
    "title": "Prerequisites and Resources",
    "description": "Prerequisite knowledge and resources for brushing up on that knowledge.",
    "author": [
      {
        "name": "andy",
        "url": {}
      }
    ],
    "date": "2021-08-09",
    "categories": [
      "Resources"
    ],
    "contents": "\nPrerequisites\nThe pre-requisites for this course are EPsy 8251 and EPsy 8252. Prerequisite knowledge include topics from a basic statistics course:\nFoundational topics in data analysis;\nDesign (e.g., random assignment and random sampling)\nDescriptive statistics and plots\nOne- and two-sample tests\n\nAnd, topics from EPsy 8251: Methods in Data Analysis for Educational Research I:\nStatistical Computation\nUsing R\nData wrangling/manipulation\nPlotting\n\nCorrelation;\nSimple regression analysis;\nModel-level and coefficient-level interpretation\nOrdinary least squares estimation\nStandardized regression\nPartitioning sums of squares\nModel-level and coefficient-level inference\nAssumption checking/residual analysis\n\nMultiple linear regression\nModel-level and coefficient-level interpretation and inference\nAssumption checking/residual analysis\nWorking with categorical predictors (including adjusting p-values for multiple tests)\nInteraction effects\n\nAnd topics from EPsy 8252: Methods in Data Analysis for Educational Research II:\nDealing with nonlinearity;\nQuadratic effects\nLog-transformations\n\nProbability distributions;\nProbability density\n\nMaximum likelihood estimation;\nModel selection;\nInformation criteria\n\nLinear mixed-effects models (cross-sectional/longitudinal)\nBasic ideas of mixed-effects models\nFitting models with random-intercepts and random-slopes\nAssumptions\nLikelihood ratio tests\n\nGeneralized linear models\nLogistic models\n\n\nResources\nFor the topics listed, students would be expected to be able to carry out an appropriate data analysis and properly interpret the results. It is also assumed that everyone enrolled in the course has some familiarity with using R. If you need a refresher on any of these topics, see:\nComputational Toolkit for Educational Scientists\nStatistical Modeling and Computation for Educational Scientists [EPsy 8251 material]\nEPsy 8252 website\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-10T11:14:10-05:00",
    "input_file": {}
  }
]
